# Задание 1

name = 'Anna'
age = 31
print(f'Привет, меня зовут {name}, мне {age} год.')
user_name = input('А как тебя зовут?\n')
age = input(f'Привет, {user_name}, сколько тебе лет?\n')
city = 'Санкт-Петербурге'
print(f'Я живу в {city}')
user_city = input('Где ты жвёшь?\n')
x = input('Назови любое число\n')
print('-'*100)
print(f'Тебя зовут {user_name}, тебе {age}, ты живёшь {user_city}. Число {x}')