# Решение системы уравнений методом Крамера
# Это система линейных упавнений
# Система уравнений - линейная
a_1, b_1, c_1, s_1 = 3, -2, 5, 7
a_2, b_2, c_2, s_2 = 7, 4, -8, 3
a_3, b_3, c_3, s_3 = 5, -3, -4, -12

m_0 = [[a_1, b_1, c_1], #00 01 02
       [a_2, b_2, c_2], #10 11 12
       [a_3, b_3, c_3]] #20 21 22
m_1 = [[s_1, b_1, c_1], [s_2, b_2, c_2], [s_3, b_3, c_3]]
m_2 = [[a_1, s_1, c_1], [a_2, s_2, c_2], [a_3, s_3, c_3]]
m_3 = [[a_1, b_1, s_1], [a_2, b_2, s_2], [a_3, b_3, s_3]]

def discr(m):
    d = m[0][0] * (m[1][1]*m[2][2] - m[2][1]*m[1][2]) - \
        m[0][1] * (m[1][0]*m[2][2] - m[2][0]*m[1][2]) + \
        m[0][2] * (m[1][0]*m[2][1] - m[2][0]*m[1][1])
    return d

d_0 = discr(m_0)
d_1 = discr(m_1)
d_2 = discr(m_2)
d_3 = discr(m_3)
print(d_0, d_1, d_2, d_3)

x = d_1/d_0
y = d_2/d_0
z = d_3/d_0
print(x, y, z)

s = a_1 * x + b_1 * y + c_1 * z
print(f'{a_1} * {x} + {b_1} * {y} + {c_1} * {z} = {s}')
s = a_2 * x + b_2 * y + c_2 * z
print(f'{a_2} * {x} + {b_2} * {y} + {c_2} * {z} = {s}')
s = a_3 * x + b_3 * y + c_3 * z
print(f'{a_3} * {x} + {b_3} * {y} + {c_3} * {z} = {s}')
